app/controllers/dining_controller.rb

SELECT * FROM "places" ORDER BY random() LIMIT 1
---
  def places
    @places = Place.all #now calling the database!!!!! w00t!